In [34]:
import pandas as pd
import numpy as np

In [35]:
list = [["Ahmet",50], ["Ali",60], ["Yağmur",70], ["Çınar",80]]
dict = {"Name": ["Ahmet","Ali","Yağmur","Çınar"], "Grade": [50,60,70,80]}
dict_list = [
                {"Name":"Ahmet","Grade":50},
                {"Name":"Ali","Grade":60},
                {"Name":"Yağmur","Grade":70},
                {"Name":"Çınar","Grade":80}
            ]

In [36]:
# pandas.DataFrame(data=[list], index=[list], columns=[list], dtype=data_type)

df = pd.DataFrame(list, index = [1,2,3,4], columns = ['Name','Grade'], dtype = float)
print(df)

     Name  Grade
1   Ahmet   50.0
2     Ali   60.0
3  Yağmur   70.0
4   Çınar   80.0

In [37]:
pd.DataFrame(dict)

     Name  Grade
0   Ahmet     50
1     Ali     60
2  Yağmur     70
3   Çınar     80

In [38]:
pd.DataFrame(dict_list)

     Name  Grade
0   Ahmet     50
1     Ali     60
2  Yağmur     70
3   Çınar     80

### Attributes

In [39]:
df = pd.DataFrame({
    'names':['Sarah','Ahmed','Ali'],
    'age':[50,60,70],
    'cgpa':[3.4,2.9,3.6],
    'address':['Karachi','Lahore','Islamabad']    
})
df

   names  age  cgpa    address
0  Sarah   50   3.4    Karachi
1  Ahmed   60   2.9     Lahore
2    Ali   70   3.6  Islamabad

In [40]:
df.T                    # Return the transpose

               0       1          2
names      Sarah   Ahmed        Ali
age           50      60         70
cgpa         3.4     2.9        3.6
address  Karachi  Lahore  Islamabad

In [41]:
df.at[1,'names']       # Similar to loc, raises an error if value not found, non-integer index can only have non-integer indexers
# df.loc[1,'names']

'Ahmed'

In [42]:
df.iat[1,0]           # Similar to iloc, iAt based indexing can only have integer indexers
# df.iat[1,0]

'Ahmed'

In [43]:
df.dtypes

names       object
age          int64
cgpa       float64
address     object
dtype: object

In [44]:
df['names'].is_unique

True

In [46]:
df.columns              # returns list of columns
df.values               # returns values
df.index                # returns the index
df.ndim                 # number of dimensions of the underlaying data, i.e series=1, dataframe=2
df.shape                # return a tuple of the shape of underlaying data
df.size                 # return number of elements in the data

RangeIndex(start=0, stop=3, step=1)